#include<stdio.h>
	char a[10][10]={'0','0','0','0','0','0','0','0','0','0',
					'.','.','0','.','.','.','0','.','a','0',
					'0','.','.','.','0','.','.','0','.','0',
					'0','.','0','0','.','.','.','.','.','0',
					'0','.','.','0','.','0','.','.','.','0',
					'0','0','.','0','.','.','.','0','.','0',
					'0','.','.','0','.','.','0','.','.','0',
					'0','.','0','0','.','0','.','5','0','0',
					'0','.','.','.','.','0','0','.','.','.',
					'0','0','0','0','0','0','0','0','0','0'};

int start()
{
	int i=2,n=1,z=0;
	char b[1];
	char ad,ap,ac;
	printf("1为人 0为墙 5为门 .为路 a为钥匙 移动输入8为上2为下4为左6为右 达到9 10即过关\n");
	ap=a[1][1];
	while(i!=9||n!=10)
	{
	printf("%c %c %c\n%c %d %c\n%c %c %c\n",a[i-2][n-2],a[i-2][n-1],a[i-2][n],a[i-1][n-2],z+1,a[i-1][n],a[i][n-2],a[i][n-1],a[i][n]);
	printf("你位目前于%d %d\n",i,n);
	printf("请输入移动方向(8 2 4 6)\n");
	scanf("%d",&b[1]);
	switch(b[1])
	{
	case 8:i--;ad=a[i-1][n-1];if(ad==48) {printf("无效移动!\n");i++;}break;
	case 2:i++;ad=a[i-1][n-1];if(ad==48) {printf("无效移动!\n");i--;}break;
	case 4:n--;ad=a[i-1][n-1];if(ad==48) {printf("无效移动!\n");n++;}break;
	case 6:n++;ad=a[i-1][n-1];if(ad==48) {printf("无效移动!\n");n--;}break;
	default:printf("Error!\n");
	}
	if(i==2&&n==9)
	{
		printf("大门已打开!\n");
		a[1][8]=ap;a[7][7]=ap;
	}
	if(i==8&&n==8)
	{
		ac=a[7][7];
		if(ac==53)
		{
			printf("无效移动，大门未打开!\n");
			i--;
		}
	}
	}
	printf("恭喜通关!\n");
	return 0;
}

int main()
{
	int x=-1;
	while(x!=0)
	{
	printf("1.开始 0.退出:");
	scanf("%d",&x);
	switch(x)
	{
	case 1:x=start();break;
	case 0:break;
	default:printf("Error!\n");
	}
	}
	return 0;
}